#include "mr_smey.h"


Map::Map() :
	a(10, "0000000000"), //карта
	b(10, std::vector<int>(10)) //номера €чеек змейки
{
	a[1][1] = 'S'; // ставим первую €чейку дл€ змейки
	b[1][1] = 1; // она перва€
	//создание €чейки дл€ первого €блока рандомом
	int g = rand() % 9;
	while (a[rand() % 10][2] == 'S')
	{
		g = rand() % 10;
	}
	a[g][2] = '+';
}


void Map::drow(sf::RenderWindow& window) //нарисовать карту
{
	for (int i = 0; i < 10; i++)
	{
		Graf gr;
		gr.draw(window, a[i], i * 10, 10, 0, 0, 0);//рисую текст
		gr.setString(window, 100, 100); //endl
	}
}


bool Map::IF(char ch, int16_t x, int16_t y) //не умерла ли змейка
{
	return ((ch == 'a' && (y - 1 < 0 || a[x][y - 1] == 'S')) || (ch == 's' && (x + 1 > 9 || a[x + 1][y] == 'S')) || (ch == 'd' && (y + 1 > 9 || a[x][y + 1] == 'S'))
		|| (ch == 'w' && (x - 1 < 0 || a[x - 1][y] == 'S')));
}


void Map::hod(std::int16_t x, std::int16_t y) //изменение змейки и €блока
{
	//съела ли змейка €блоко
	bool h = 0;
	smey gh;
	if (a[x][y] == '+')
	{
		h = 1;
		//змейка растет
		gh.Dplus(); // d++
	}
	//голова змейки ходит
	a[x][y] = 'S';
	b[x][y] = 1;
	int z = 1; //на какой €чейке змейки находитс€ след цикл
	//удал€ем €чейку с хвостом (у нее максимальный номер) и мен€ем номера, если змейка не съела €блоко
	int q = x, w = y; //где мы находимс€
	for (int i = 0; i < gh.D() + 1; i++)
	{
		//ищем предыдущую €чейку змейки (ее номер завен z)
		if (q > 0 && b[q - 1][w] == z)
		{
			z++; //следующа€ €чейка на 1 больше
			q--; //мен€ем позицию €чейки на которой мы находимс€
			b[q][w]++; //увеличиваем номер €чейки на которой мы находимс€
			if (b[q][w] > gh.D()) //мы на последней €чейке змейки?
			{
				if (h == 0) // если змейка съела €блоко, то ее нельз€ уменьшать
				{
					b[q][w] = 0;
					a[q][w] = '0';
				}
				break;
			}
		}
		if (w > 0 && b[q][w - 1] == z)
		{
			z++;
			w--;
			b[q][w]++;
			if (b[q][w] > gh.D())
			{
				if (h == 0)
				{
					b[q][w] = 0;
					a[q][w] = '0';
				}
				break;
			}
			continue;
		}
		if (q < 9 && b[q + 1][w] == z)
		{
			z++;
			q++;
			b[q][w]++;
			if (b[q][w] > gh.D())
			{
				if (h == 0)
				{
					b[q][w] = 0;
					a[q][w] = '0';
				}
				break;
			}
			continue;
		}
		if (w < 9 && b[q][w + 1] == z)
		{
			z++;
			w++;
			b[q][w]++;
			if (b[q][w] > gh.D())
			{
				if (h == 0)
				{
					b[q][w] = 0;
					a[q][w] = '0';
				}
				break;
			}
		}
	}
	//создаем новое €блоко
	if (h) //создавать €блоко можно только тогда, когда змей съел предыдущую
	{
		int g = rand() % 9, l = rand() % 9; // рандомный номер дл€ €блока
		while (a[g][l] == 'S') // €блоко нельз€ создавать в змейке
		{
			g = rand() % 10; // мен€ем координаты €блока
			l = rand() % 9;
		}
		a[g][l] = '+'; // ставим €блоко
	}
}