//#include "mr_smey.h"
//
//
//smey::smey()
//{
//	x = 1, y = 1, t = 0, d = 1; // место головы змейки, время после последнего шага змейки, рост змеи;
//}
//
//
//void smey::Dplus() //Увеличить длину змея
//{
//	d++;
//}
//
//
//int smey::D() //показать d
//{
//	return d;
//}
//
//
//void smey::Game(sf::RenderWindow& window)	//сама игра
//{
//
//	while (d < 100)
//	{
//		system("cls");
//		Map z;
//		Graf gr;
//		z.drow(window);//вывод карты
//		//змейка ходит
//		t++; //время увеличивается
//		//не прошло ли 0,5 секунды
//		if (t >= 3)
//		{
//			//не выходит ли звейка за границы карты
//			if (z.IF(ch, x, y))
//			{
//				// :(
//				gr.draw(window, "Game Over. Your name's \"lox\" :(", 10, 10, 255, 0, 0);
//				while (true)
//				{
//
//				}
//			}
//			//змейка ходит
//			if (ch == 'a')
//			{
//				y--;
//			}
//			if (ch == 's')
//			{
//				x++;
//			}
//			if (ch == 'd')
//			{
//				y++;
//			}
//			if (ch == 'w')
//			{
//				x--;
//			}
//
//			t = 0;
//		}
//		//изменяем карту
//	}
//}